In [89]:
import pandas as pd
import numpy as np

In [90]:
data=pd.read_csv("C:\\Users\\ABHISHEK\\Desktop\\python\\bank\\bank.csv")
data.head(5)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [91]:
data.describe()

,age,balance,day,duration,campaign,pdays,previous
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,1422.657819,15.915284,263.961292,2.793630,39.766645,0.542579
std,10.576211,3009.638142,8.247667,259.856633,3.109807,100.121124,1.693562
min,19.000000,-3313.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,69.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,444.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,1480.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,71188.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

In [92]:
data.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

In [93]:
!pip install kmodes

Requirement already satisfied: kmodes in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (0.10.2)

WARNING: You are using pip version 20.3.1; however, version 20.3.3 is available.
You should consider upgrading via the 'c:\users\abhishek\appdata\local\programs\python\python37-32\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: numpy>=1.10.4 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (from kmodes) (1.19.0)
Requirement already satisfied: scipy>=0.13.3 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (from kmodes) (1.5.3)
Requirement already satisfied: scikit-learn>=0.19.0 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (from kmodes) (0.23.2)
Requirement already satisfied: joblib>=0.11 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (from kmodes) (0.17.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (from scikit-learn>=0.19.0->kmodes) (2.1.0)
Requirement already satisfied: numpy>=1.10.4 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (from kmodes) (1.19.0)
Requirement already satisfied: scipy>=0.13.3 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (from kmodes) (1.5.3)
Requirement already satisfied: joblib>=0.11 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (from kmodes) (0.17.0)
Requirement already satisfied: numpy>=1.10.4 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (from kmodes) (1.19.0)

In [94]:
from kmodes.kprototypes import KPrototypes

In [95]:
data=data.drop(['contact','day','month','duration','campaign','pdays','previous','poutcome','y'],axis=1)

In [96]:
len(data)

4521

In [97]:
data.head(5)

   age          job  marital  education default  balance housing loan
0   30   unemployed  married    primary      no     1787      no   no
1   33     services  married  secondary      no     4789     yes  yes
2   35   management   single   tertiary      no     1350     yes   no
3   30   management  married   tertiary      no     1476     yes  yes
4   59  blue-collar  married  secondary      no        0     yes   no

In [98]:
input=data.to_numpy()

In [99]:
input

array([[30, 'unemployed', 'married', ..., 1787, 'no', 'no'],
       [33, 'services', 'married', ..., 4789, 'yes', 'yes'],
       [35, 'management', 'single', ..., 1350, 'yes', 'no'],
       ...,
       [57, 'technician', 'married', ..., 295, 'no', 'no'],
       [28, 'blue-collar', 'married', ..., 1137, 'no', 'no'],
       [44, 'entrepreneur', 'single', ..., 1136, 'yes', 'yes']],
      dtype=object)

In [100]:
data['age']=data['age'].astype(float)
data['balance']=data['balance'].astype(float)

In [101]:
kp=KPrototypes(n_clusters=3,max_iter=20,verbose=2)
clusters=kp.fit_predict(input,categorical=[1,2,3,4,6,7])

Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 1, iteration: 1/20, moves: 1941, ncost: 15607829310.057137
Run: 1, iteration: 2/20, moves: 1377, ncost: 12657717051.661098
Run: 1, iteration: 3/20, moves: 509, ncost: 11113413964.53866
Run: 1, iteration: 4/20, moves: 246, ncost: 10089644678.585632
Run: 1, iteration: 5/20, moves: 119, ncost: 9664894657.192202
Run: 1, iteration: 6/20, moves: 59, ncost: 9595908430.803173
Run: 1, iteration: 7/20, moves: 35, ncost: 9561732587.913853
Run: 1, iteration: 8/20, moves: 26, ncost: 9527218571.238554
Run: 1, iteration: 9/20, moves: 8, ncost: 9523496792.954126
Run: 1, iteration: 10/20, moves: 0, ncost: 9523496792.954126
Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 2, iteration: 1/20, moves: 1100, ncost: 19534510959.364887
Run: 2, iteration: 2/20, moves: 2073, ncost: 15844236572.714476
Run: 2, iteration: 3/20, moves: 1035, ncost: 12754503414.607729
Run: 2, iteration: 4/20, moves: 497, ncost: 11125404122.307571
Run: 2, iteration: 5/20, moves: 246, ncost: 10089644678.585632
Run: 2, iteration: 6/20, moves: 119, ncost: 9664894657.192202
Run: 2, iteration: 7/20, moves: 59, ncost: 9595908430.803173
Run: 2, iteration: 8/20, moves: 35, ncost: 9561732587.913853
Run: 2, iteration: 9/20, moves: 26, ncost: 9527218571.238554
Run: 2, iteration: 10/20, moves: 8, ncost: 9523496792.954126
Run: 2, iteration: 11/20, moves: 0, ncost: 9523496792.954126
Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 3, iteration: 1/20, moves: 233, ncost: 11825806862.099497
Run: 3, iteration: 2/20, moves: 214, ncost: 10500113149.061335
Run: 3, iteration: 3/20, moves: 149, ncost: 9806287723.709105
Run: 3, iteration: 4/20, moves: 81, ncost: 9638543657.37879
Run: 3, iteration: 5/20, moves: 47, ncost: 9576537215.754866
Run: 3, iteration: 6/20, moves: 27, ncost: 9554306453.678183
Run: 3, iteration: 7/20, moves: 19, ncost: 9526856476.746733
Run: 3, iteration: 8/20, moves: 6, ncost: 9523496792.954126
Run: 3, iteration: 9/20, moves: 0, ncost: 9523496792.954126
Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 4, iteration: 1/20, moves: 102, ncost: 10379624500.32523
Run: 4, iteration: 2/20, moves: 99, ncost: 9766807700.369589
Run: 4, iteration: 3/20, moves: 67, ncost: 9633236294.675573
Run: 4, iteration: 4/20, moves: 42, ncost: 9575039176.58857
Run: 4, iteration: 5/20, moves: 34, ncost: 9532242363.731165
Run: 4, iteration: 6/20, moves: 13, ncost: 9523507648.113214
Run: 4, iteration: 7/20, moves: 1, ncost: 9523496792.954126
Run: 4, iteration: 8/20, moves: 0, ncost: 9523496792.954126
Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 5, iteration: 1/20, moves: 245, ncost: 9988666151.59389
Run: 5, iteration: 2/20, moves: 49, ncost: 9650334438.885092
Run: 5, iteration: 3/20, moves: 46, ncost: 9581212907.704302
Run: 5, iteration: 4/20, moves: 30, ncost: 9558932539.360582
Run: 5, iteration: 5/20, moves: 20, ncost: 9526856476.746733
Run: 5, iteration: 6/20, moves: 6, ncost: 9523496792.954126
Run: 5, iteration: 7/20, moves: 0, ncost: 9523496792.954126
Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 6, iteration: 1/20, moves: 1594, ncost: 16701587849.7066
Run: 6, iteration: 2/20, moves: 1644, ncost: 13288688311.644623
Run: 6, iteration: 3/20, moves: 612, ncost: 11418065951.128408
Run: 6, iteration: 4/20, moves: 298, ncost: 10246531379.005215
Run: 6, iteration: 5/20, moves: 147, ncost: 9701040632.3928
Run: 6, iteration: 6/20, moves: 72, ncost: 9605662880.332268
Run: 6, iteration: 7/20, moves: 41, ncost: 9567757831.912066
Run: 6, iteration: 8/20, moves: 29, ncost: 9527218571.238554
Run: 6, iteration: 9/20, moves: 8, ncost: 9523496792.954126
Run: 6, iteration: 10/20, moves: 0, ncost: 9523496792.954126
Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 7, iteration: 1/20, moves: 1180, ncost: 14787278164.053686
Run: 7, iteration: 2/20, moves: 717, ncost: 12315891636.954605
Run: 7, iteration: 3/20, moves: 395, ncost: 10931547529.271177
Run: 7, iteration: 4/20, moves: 214, ncost: 9951316291.580862
Run: 7, iteration: 5/20, moves: 111, ncost: 9648837848.95956
Run: 7, iteration: 6/20, moves: 56, ncost: 9578006107.79555
Run: 7, iteration: 7/20, moves: 30, ncost: 9558932539.360582
Run: 7, iteration: 8/20, moves: 20, ncost: 9526856476.746733
Run: 7, iteration: 9/20, moves: 6, ncost: 9523496792.954126
Run: 7, iteration: 10/20, moves: 0, ncost: 9523496792.954126
Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 8, iteration: 1/20, moves: 1092, ncost: 19404951799.881207
Run: 8, iteration: 2/20, moves: 2066, ncost: 15788208430.065763
Run: 8, iteration: 3/20, moves: 1004, ncost: 12731761453.258492
Run: 8, iteration: 4/20, moves: 492, ncost: 11120984028.157463
Run: 8, iteration: 5/20, moves: 243, ncost: 10089644678.585632
Run: 8, iteration: 6/20, moves: 119, ncost: 9664894657.192202
Run: 8, iteration: 7/20, moves: 59, ncost: 9595908430.803173
Run: 8, iteration: 8/20, moves: 35, ncost: 9561732587.913853
Run: 8, iteration: 9/20, moves: 26, ncost: 9527218571.238554
Run: 8, iteration: 10/20, moves: 8, ncost: 9523496792.954126
Run: 8, iteration: 11/20, moves: 0, ncost: 9523496792.954126
Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 9, iteration: 1/20, moves: 444, ncost: 13445048930.433088
Run: 9, iteration: 2/20, moves: 425, ncost: 11412671680.060444
Run: 9, iteration: 3/20, moves: 261, ncost: 10238281786.405298
Run: 9, iteration: 4/20, moves: 141, ncost: 9701040632.3928
Run: 9, iteration: 5/20, moves: 72, ncost: 9605662880.332268
Run: 9, iteration: 6/20, moves: 41, ncost: 9567757831.912066
Run: 9, iteration: 7/20, moves: 29, ncost: 9527218571.238554
Run: 9, iteration: 8/20, moves: 8, ncost: 9523496792.954126
Run: 9, iteration: 9/20, moves: 0, ncost: 9523496792.954126
Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run: 10, iteration: 1/20, moves: 947, ncost: 14566577374.550264
Run: 10, iteration: 2/20, moves: 639, ncost: 12107108504.238216
Run: 10, iteration: 3/20, moves: 371, ncost: 10709906894.420454
Run: 10, iteration: 4/20, moves: 198, ncost: 9872110039.312965
Run: 10, iteration: 5/20, moves: 94, ncost: 9645160039.81064
Run: 10, iteration: 6/20, moves: 52, ncost: 9576893859.568378
Run: 10, iteration: 7/20, moves: 28, ncost: 9554306453.678183
Run: 10, iteration: 8/20, moves: 19, ncost: 9526856476.746733
Run: 10, iteration: 9/20, moves: 6, ncost: 9523496792.954126
Run: 10, iteration: 10/20, moves: 0, ncost: 9523496792.954126
Best run was number 1

In [102]:
print(kp.cluster_centroids_)

[array([[   40.84557682,   543.9306777 ],
       [   42.91111111,  5202.86495726],
       [   44.54285714, 18361.77142857]]), array([['blue-collar', 'married', 'secondary', 'no', 'yes', 'no'],
       ['management', 'married', 'secondary', 'no', 'yes', 'no'],
       ['management', 'married', 'tertiary', 'no', 'no', 'no']],
      dtype='<U11')]

In [103]:
print(clusters)

[0 1 0 ... 0 0 0]

In [104]:
cluster_list=[]
for c in clusters:
  cluster_list.append(c)

In [105]:
no_of_clusters=max(cluster_list)+1
no_of_clusters

3

In [106]:
data['cluster_no']=cluster_list

In [107]:
data.head()

,age,job,marital,education,default,balance,housing,loan,cluster_no
0,30.0,unemployed,married,primary,no,1787.0,no,no,0
1,33.0,services,married,secondary,no,4789.0,yes,yes,1
2,35.0,management,single,tertiary,no,1350.0,yes,no,0
3,30.0,management,married,tertiary,no,1476.0,yes,yes,0
4,59.0,blue-collar,married,secondary,no,0.0,yes,no,0

In [108]:
for i in range(0,no_of_clusters):
  print(data[data['cluster_no']==i])

       age            job  marital  education default  balance housing loan  \
0     30.0     unemployed  married    primary      no   1787.0      no   no
2     35.0     management   single   tertiary      no   1350.0     yes   no
3     30.0     management  married   tertiary      no   1476.0     yes  yes
4     59.0    blue-collar  married  secondary      no      0.0     yes   no
5     35.0     management   single   tertiary      no    747.0      no   no
...    ...            ...      ...        ...     ...      ...     ...  ...
4516  33.0       services  married  secondary      no   -333.0     yes   no
4517  57.0  self-employed  married   tertiary     yes  -3313.0     yes  yes
4518  57.0     technician  married  secondary      no    295.0      no   no
4519  28.0    blue-collar  married  secondary      no   1137.0      no   no
4520  44.0   entrepreneur   single   tertiary      no   1136.0     yes  yes

      cluster_no
0              0
2              0
3              0
4              0
5              0
...          ...
4516           0
4517           0
4518           0
4519           0
4520           0

[3866 rows x 9 columns]
       age         job   marital  education default  balance housing loan  \
1     33.0    services   married  secondary      no   4789.0     yes  yes
10    39.0    services   married  secondary      no   9374.0     yes   no
16    56.0  technician   married  secondary      no   4073.0      no   no
25    41.0  management   married   tertiary      no   5883.0      no   no
30    68.0     retired  divorced  secondary      no   4189.0      no   no
...    ...         ...       ...        ...     ...      ...     ...  ...
4473  33.0  technician   married  secondary      no   4790.0     yes   no
4484  38.0  management   married   tertiary      no   3436.0      no   no
4489  45.0  management   married   tertiary      no   6945.0      no   no
4490  58.0      admin.   married  secondary      no   3496.0     yes   no
4500  38.0      admin.   married  secondary      no   4196.0     yes   no

      cluster_no
1              1
10             1
16             1
25             1
30             1
...          ...
4473           1
4484           1
4489           1
4490           1
4500           1

[585 rows x 9 columns]
       age          job  marital  education default  balance housing loan  \
40    38.0   management   single   tertiary      no  11971.0     yes   no
64    56.0       admin.  married  secondary      no  16873.0      no   no
94    57.0  blue-collar  married  secondary      no  14093.0      no   no
272   46.0   management  married  secondary      no  12186.0      no   no
500   32.0   management   single   tertiary      no  12607.0      no   no
...    ...          ...      ...        ...     ...      ...     ...  ...
4338  50.0   management  married   tertiary      no  19447.0     yes  yes
4363  38.0  blue-collar   single  secondary      no  13156.0     yes   no
4369  57.0   technician  married  secondary      no  16063.0     yes   no
4440  45.0  blue-collar  married    primary      no  13117.0      no   no
4441  38.0   management  married   tertiary      no  12877.0      no   no

      cluster_no
40             2
64             2
94             2
272            2
500            2
...          ...
4338           2
4363           2
4369           2
4440           2
4441           2

[70 rows x 9 columns]

# Applying algorithm

In [109]:
#No of nodes
n=3

In [110]:
def find_similarity(data1,data2):
     return len(pd.merge(data1,data2,how='inner',on=['age',	'job',	'marital','education'	,'default',	'balance',	'housing','loan']))/len(pd.concat([data1,data2]))

In [111]:
def merge(data1,data2):
  cno=data1[0]['cluster_no']
  data2.drop('cluster_no')
  data2['cluster_no']=[cno]*len(data2)
  return pd.concat(data1,data2)

In [112]:
df={}
frag_after_merge={}
rows, cols = (no_of_clusters-1, no_of_clusters-1) 
similar = [[0]*cols]*rows 
def find_clustered_fragment(data,n):
    for i in range(0,no_of_clusters):
      new_data=data[data['cluster_no']==i]
      df[i]=pd.DataFrame(new_data,columns=data.columns)
    for data1 in df.values():
      for data2 in df.values():
        if data1.equals(data2)==False:
          similar.append(find_similarity(data1,data2))
    i=no_of_clusters
    j=0
    while i>n:
       for data1 in df.values():
          for data2 in df.values():
            iwhf data1.equals(data2)==False:
              temp=merge(data1,data2)
              frag_after_merge[j]=pd.DataFrame(temp,columns=data.columns)
              j+=1

In [113]:
find_clustered_fragment(data,3)

In [114]:
find_clustered_fragment(data,3)

In [115]:
frag_after_merge

{}

In [116]:
df[2]

,age,job,marital,education,default,balance,housing,loan,cluster_no
40,38.0,management,single,tertiary,no,11971.0,yes,no,2
64,56.0,admin.,married,secondary,no,16873.0,no,no,2
94,57.0,blue-collar,married,secondary,no,14093.0,no,no,2
272,46.0,management,married,secondary,no,12186.0,no,no,2
500,32.0,management,single,tertiary,no,12607.0,no,no,2
...,...,...,...,...,...,...,...,...,...
4338,50.0,management,married,tertiary,no,19447.0,yes,yes,2
4363,38.0,blue-collar,single,secondary,no,13156.0,yes,no,2
4369,57.0,technician,married,secondary,no,16063.0,yes,no,2
4440,45.0,blue-collar,married,primary,no,13117.0,no,no,2
4441,38.0,management,married,tertiary,no,12877.0,no,no,2

In [160]:
df[2]['age'].max()

75.0

In [117]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (2.8.6)

WARNING: You are using pip version 20.3.1; however, version 20.3.3 is available.
You should consider upgrading via the 'c:\users\abhishek\appdata\local\programs\python\python37-32\python.exe -m pip install --upgrade pip' command.

In [118]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\abhishek\appdata\local\programs\python\python37-32\lib\site-packages (1.3.22)

WARNING: You are using pip version 20.3.1; however, version 20.3.3 is available.
You should consider upgrading via the 'c:\users\abhishek\appdata\local\programs\python\python37-32\python.exe -m pip install --upgrade pip' command.

In [137]:
import psycopg2
import sqlalchemy
from sqlalchemy import create_engine
print("Connecting to all the servers")

con = psycopg2.connect(host="localhost", database="abhi",port=5432, user="postgres", password="abhi")
con1 = psycopg2.connect(host="34.87.60.35", database="abhi",port=5432, user="postgres", password="abhi")
con2 = psycopg2.connect(host="35.240.159.243", database="abhi",port=5432, user="postgres", password="abhi")
print("All servers are connected")
cursor=con.cursor()
cursor1=con1.cursor()
cursor2=con2.cursor()
cursor.execute("CREATE TABLE fragment1(age integer,job varchar,marital varchar(50),education varchar(50),defaullt varchar(50) ,balance double precision,housing varchar(50) ,loan varchar(50),cluster_no integer);");
con.close()
cursor1.execute("CREATE TABLE fragment2(age integer,job varchar,marital varchar(50),education varchar(50),defaullt varchar(50) ,balance double precision,housing varchar(50) ,loan varchar(50),cluster_no integer);");
con1.close()
cursor2.execute("CREATE TABLE fragment3(age integer,job varchar,marital varchar(50),education varchar(50),defaullt varchar(50) ,balance double precision,housing varchar(50) ,loan varchar(50),cluster_no integer);");
con2.close()
connect1 = create_engine("postgresql+psycopg2://%s:%s@%s:5432/%s" % (
    'postgres',
    'abhi',
    'localhost',
    'abhi'
))
connect2 = create_engine("postgresql+psycopg2://%s:%s@%s:5432/%s" % (
    'postgres',
    'abhi',
    '34.87.60.35',
    'abhi'
))
connect3 = create_engine("postgresql+psycopg2://%s:%s@%s:5432/%s" % (
    'postgres',
    'abhi',
    '35.240.159.243',
    'abhi'
))
df[0].to_sql('fragment1',connect1,if_exists='append',index=False)
print("fragment1 allocated to node1")
df[1].to_sql('fragment2',connect2,if_exists='append',index=False)
print("fragment2 allocated to node2")
df[2].to_sql('fragment3',connect3,if_exists='append',index=False)
print("fragment3 allocated to node3")

Connecting to all the servers
All servers are connected
fragment1 allocated to node1
fragment2 allocated to node2
fragment3 allocated to node3

# fragmentation without Data sementics(Using predicates)

In [138]:
data1=pd.read_csv("C:\\Users\\ABHISHEK\\Desktop\\python\\bank\\bank.csv")
data1.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [139]:
data1.describe()

,age,balance,day,duration,campaign,pdays,previous
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,1422.657819,15.915284,263.961292,2.793630,39.766645,0.542579
std,10.576211,3009.638142,8.247667,259.856633,3.109807,100.121124,1.693562
min,19.000000,-3313.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,69.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,444.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,1480.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,71188.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

In [147]:
df1={}
new_data1=data1[data1['age']<40]
df1[0]=pd.DataFrame(new_data1,columns=data1.columns)
new_data2=data1[data1['age']==40]
df1[1]=pd.DataFrame(new_data2,columns=data1.columns)
new_data3=data1[data1['age']>40]
df1[2]=pd.DataFrame(new_data3,columns=data1.columns)

In [150]:
df1[1].head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
15,40,management,married,tertiary,no,194,no,yes,cellular,29,aug,189,2,-1,0,unknown,no
77,40,technician,single,secondary,no,591,no,yes,cellular,14,aug,87,6,-1,0,unknown,no
79,40,unemployed,married,secondary,no,219,yes,no,cellular,17,nov,204,2,196,1,failure,no
172,40,admin.,single,secondary,no,462,yes,yes,cellular,6,apr,272,1,335,4,other,no
183,40,admin.,divorced,secondary,no,6,no,no,unknown,11,jun,140,1,-1,0,unknown,no

In [152]:
con = psycopg2.connect(host="localhost", database="abhi",port=5432, user="postgres", password="abhi")
con1 = psycopg2.connect(host="34.87.60.35", database="abhi",port=5432, user="postgres", password="abhi")
con2 = psycopg2.connect(host="35.240.159.243", database="abhi",port=5432, user="postgres", password="abhi")
print("All servers are connected")
cursor=con.cursor()
cursor1=con1.cursor()
cursor2=con2.cursor()
cursor.execute("CREATE TABLE fragmentwds1(age integer,job varchar,marital varchar(50),education varchar(50),defaullt varchar(50) ,balance double precision,housing varchar(50) ,loan varchar(50),contact varchar(50),day integer,month varchar(50),duration integer,campaign integer,pdays integer,  previous integer,poutcome integer,y varchar(50));");
con.close()
cursor1.execute("CREATE TABLE fragmentwds2(age integer,job varchar,marital varchar(50),education varchar(50),defaullt varchar(50) ,balance double precision,housing varchar(50) ,loan varchar(50),contact varchar(50),day integer,month varchar(50),duration integer,campaign integer,pdays integer,  previous integer,poutcome integer,y varchar(50));");
con1.close()
cursor2.execute("CREATE TABLE fragmentwds3(age integer,job varchar,marital varchar(50),education varchar(50),defaullt varchar(50) ,balance double precision,housing varchar(50) ,loan varchar(50),contact varchar(50),day integer,month varchar(50),duration integer,campaign integer,pdays integer,  previous integer,poutcome integer,y varchar(50));");
con2.close()
connect1 = create_engine("postgresql+psycopg2://%s:%s@%s:5432/%s" % (
    'postgres',
    'abhi',
    'localhost',
    'abhi'
))
connect2 = create_engine("postgresql+psycopg2://%s:%s@%s:5432/%s" % (
    'postgres',
    'abhi',
    '34.87.60.35',
    'abhi'
))
connect3 = create_engine("postgresql+psycopg2://%s:%s@%s:5432/%s" % (
    'postgres',
    'abhi',
    '35.240.159.243',
    'abhi'
))
df1[0].to_sql('fragmentwds1',connect1,if_exists='append',index=False)
print("fragmentwds1 allocated to node1")
df1[1].to_sql('fragmentwds2',connect2,if_exists='append',index=False)
print("fragmentwds2 allocated to node2")
df1[2].to_sql('fragmentwds3',connect3,if_exists='append',index=False)
print("fragmentwds3 allocated to node3")

All servers are connected
fragmentwds1 allocated to node1
fragmentwds2 allocated to node2
fragmentwds3 allocated to node3

# List of queries

In [20]:
import time
MD1={
    'ip':"localhost",
    'minval':19,
    'maxval':87
}
MD2={
    'ip':"34.87.60.35",
    'minval':21,
    'maxval':80
}
MD3={
    'ip':"35.240.159.243",
    'minval':25,
    'maxval':75
}

# query processing without using data semantics
con = psycopg2.connect(host="localhost", database="abhi",port=5432, user="postgres", password="abhi")
con1 = psycopg2.connect(host="34.87.60.35", database="abhi",port=5432, user="postgres", password="abhi")
con2 = psycopg2.connect(host="35.240.159.243", database="abhi",port=5432, user="postgres", password="abhi")
cursor=con.cursor()
cursor1=con1.cursor()
cursor2=con2.cursor()
start_time = time.time()
cursor.execute("SELECT * FROM fragment1 WHERE age=20;")
con.close()
cursor1.execute("SELECT * FROM fragment2 WHERE age=20;")
con1.close()
cursor2.execute("SELECT * FROM fragment3 WHERE age=20;")
con2.close()
end_time=time.time()
print(end_time*1000-start_time*1000)

727.288330078125

In [21]:
# query processing with using data semantics
con = psycopg2.connect(host="localhost", database="abhi",port=5432, user="postgres", password="abhi")
cursor=con.cursor()
start_time = time.time()
cursor.execute("SELECT * FROM fragmentwds1 WHERE age=20;")
con.close()
end_time=time.time()
print(end_time*1000-start_time*1000)

3.28662109375

In [16]:
# query processing without using data semantics
import psycopg2
import time
con = psycopg2.connect(host="localhost", database="abhi",port=5432, user="postgres", password="abhi")
con1 = psycopg2.connect(host="34.87.60.35", database="abhi",port=5432, user="postgres", password="abhi")
con2 = psycopg2.connect(host="35.240.159.243", database="abhi",port=5432, user="postgres", password="abhi")
cursor=con.cursor()
cursor1=con1.cursor()
cursor2=con2.cursor()
start_time = time.time()
cursor.execute("SELECT * FROM fragmentwds1 WHERE age=39;")
con.close()
cursor1.execute("SELECT * FROM fragmentwds2 WHERE age=39;")
con1.close()
cursor2.execute("SELECT * FROM fragmentwds3 WHERE age=39;")
con2.close()
end_time=time.time()
print(end_time*1000-start_time*1000)

1358.8505859375

In [17]:
# query processing with using data semantics
con = psycopg2.connect(host="localhost", database="abhi",port=5432, user="postgres", password="abhi")
cursor=con.cursor()
start_time = time.time()
cursor.execute("SELECT * FROM fragment1 WHERE age=39;")
con.close()
end_time=time.time()
print(end_time*1000-start_time*1000)

1.99951171875

In [22]:
# query processing without using data semantics
con = psycopg2.connect(host="localhost", database="abhi",port=5432, user="postgres", password="abhi")
con1 = psycopg2.connect(host="34.87.60.35", database="abhi",port=5432, user="postgres", password="abhi")
con2 = psycopg2.connect(host="35.240.159.243", database="abhi",port=5432, user="postgres", password="abhi")
cursor=con.cursor()
cursor1=con1.cursor()
cursor2=con2.cursor()
start_time = time.time()
cursor.execute("SELECT * FROM fragmentwds1 WHERE age=29;")
con.close()
cursor1.execute("SELECT * FROM fragmentwds2 WHERE age=29;")
con1.close()
cursor2.execute("SELECT * FROM fragmentwds3 WHERE age=29;")
con2.close()
end_time=time.time()
print(end_time*1000-start_time*1000)

526.884765625

In [23]:
# query processing with using data semantics
con = psycopg2.connect(host="localhost", database="abhi",port=5432, user="postgres", password="abhi")
cursor=con.cursor()
start_time = time.time()
cursor.execute("SELECT * FROM fragment1 WHERE age=29;")
con.close()
end_time=time.time()
print(end_time*1000-start_time*1000)

0.0